Openfoam-Xeon-host/OpenFOAM-2.3.1/tutorials/compressible/rhoPorousSimpleFoam/angledDuctImplicit/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

source1
{
    type            fixedTemperatureConstraint;
    active          true;
    selectionMode   cellZone;
    cellZone        porosity;

    fixedTemperatureConstraintCoeffs
    {
        mode            uniform;
        temperature     350;
    }
}


// ************************************************************************* //
